{"pages":[{"title":"categories","text":"","link":"/categories/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"《恶意》读书笔记","text":"无边的恶意，深不见底，有如万丈深渊。杀人不是目的，而是手段；死亡不是结束，而是开始。 &emsp;&emsp;很久没有读过书了，生活似乎进入了恶性循环，做不完的工作，睡不醒的觉。一切都与自己最初的想法背道而驰，完全没有动力，对生活没有新鲜感，这样的状态让我恐慌。为了抑制那点恐慌，最近拿起了很久没摸过的书，发现还有几本未曾开封，挑了一本随便读起来。东野圭吾的文字还是那么的吸引人，所以没有停下来，花了两天时间读完了这本《恶意》。&emsp;&emsp;读完整本书，感觉东野对整个故事情节的把握做到了极致，情节的不断反转令人感叹，这是东野的特点。除了对东野在推理小说上的精湛技艺表示感慨，他对人性的思考也值得我们深思。当一个人为了某个目的，采取杀人这种手段，展示出来的人性让我惊恐，但是在这个社会上何尝不是这样呢。东野他是对人性、对社会做过多么深入的思考呀。&emsp;&emsp;真的是：这世间唯太阳和人心不能直视。","link":"/2019/07/03/《恶意》读书笔记/"},{"title":"《浪潮之巅》读书笔记","text":"前一段时间读了一下《浪潮之巅》这本书，原本是吴军博士连载于Google黑板报上的，它记录了近一百年来许多IT公司的兴衰，这些公司有意或无意的站在了技术革命的浪潮之中，一旦处于这个位置，它会顺应历史潮流发展壮大，即使不做任何事情，也会搭上这浪潮发展多年。书中讲述了从百年前的AT&amp;T到Yahoo, Google, Facebook等公司的发展历程，以及华尔街对科技行业的影响，非常值的一读。作为一名重度拖延者，花了两个多月才把它看完，确实收获颇多，值得反复阅读，这里记下一些算是笔记吧。 IT领域定律 摩尔定律: 微处理器的性能每18个月会翻一番，也可以说每18个月相同性能的处理器价格会下降一半，当然也有其它的说法，但意思都是一样的。 安迪比尔定律: 这个定律意思是安迪给你的，比尔都会拿走。安迪是Intel的创始人之一Andy Grove，比尔则是微软创始人之一Bill Gates，原话是: ‘Andy gives, Bill takes away’。就是说在硬件方面性能的提高会迅速被软件耗尽。 反摩尔定律: 一个IT公司如果今天和18个月前卖掉同样多的，同样的产品，那么它的营业额就要降低一半，因为产品的价格只有18个月前的一半了。 721定律: 在一个成熟的领域，行业老大一般会占70%左右的市场，是主导者；老二会占20%左右的市场，是这个行业的挑战者；剩下10%则是一些追随者。 诺威格定律: 当一个公司的市场占有率超过50%后，就无法再使市场占有率翻番了。 公司基因一个公司能不能成为百年企业，或者说能不能一直处于具有竞争力的状态，很大程度上取决于这个公司的基因。从AT&amp;T，朗讯到IBM，微软无一不体现着公司的基因，IBM主要服务于企业市场，它的营收依赖于企业市场，在个人计算机领域，IBM也有所涉及，但最终都放弃了这块业务，卖给了中国联想。微软做为一个强大的IT公司，在与网景等公司的竞争中都依靠它的操作系统赢得了最终的胜利，似乎它是不可战胜的，但是在互联网浪潮来临时，它却在与Yahoo，Google等互联网公司的竞争中占不到便宜，因为它的基因不是一家依靠互联网的公司。 转型一个大体量的公司，在某个领域处于一个绝对领先的地位，别人无法超越，自然从这个领域获得的利益也是无法估量的，但是根据诺威格定律，这个时候市场不能再翻番，那么为了公司能长期盈利就必须寻找新的营收增长点。例如Motolora作为曾经的手机行业老大，它在模拟手机领域的地位无人能及，在数字手机来临时，它并非没有看到未来是数字手机的时代，但它并不想看到这种未来，极力去推迟数字手机的来临，因为这样可以在模拟手机领域继续保持收入，最终丢掉了行业老大的位置。另一个与之相反的公司3M公司，它不断放弃旧的产业，甚至是那些还在盈利的部门，去开拓新的盈收点，当然最终的结果也就与motorola相反了。 华尔街书中大致描述了华尔街是怎么操控一个IT公司的，在资本家面前，怎么取得利益最大化才是他们关心的，所以很多创业者一手创建起来的公司却最终被资本家们控制。金融方面的需要再次阅读才能更加了解，大概就先记下这么一点吧。 《浪潮之巅》这本书的内容可以说是一部IT发展史，内容很丰富，肯定不止我三言两语写的这些，有时间需要多读几遍。","link":"/2019/04/29/《浪潮之巅》读书笔记/"},{"title":"计算机网络基础","text":"最近再次看了一下计算机网络的内容，记录一下大概内容 1. 概述1.1 计算机网络分为边缘部分和核心部分： 边缘部分是连接到网络上的各个主机； 核心部分是所有路由器及所连接的网络。 1.2 计算机网络三种分层结构 七层网络层次结构 应用层 表示层 会话层 运输层 网络层 数据链路层 物理层 五层网络层次结构 应用层 运输层 网络层 数据链路层 物理层 四层网络层次结构 应用层 运输层 网络层 网络接口层1.3 计算机网络的性能指标 速率 带宽 吞吐量 时延，时延分为以下几种类型 发送时延：主机或路由器发送帧数据所需要的时间 传播时延：电磁波在信道中传播一定的距离需要花费的时间 处理时延：主机或路由器在收到分组后处理这些数据所需的时间 排队时延：分组在路由器的队列中等待所花费的时间 时延带宽积 往返时间RTT 利用率 2. 物理层2.1 基本概念 模拟信号或连续信号，消息参数的取值是连续的。 数字信号或离散信号，消息参数的取值是离散的。 单向通信又称单工通信，只能有一个方向的通信而没有反方向的交互 双向交替通信又称半双工通信，通信的双方都可以发送信息，但是不能同时发送 双向同时通信又称全双工通信，通信的双方可以同时发送和接收信息 ADSL非对称数字用户线，是对现有的模拟电话用户线进行的改造，因其上行带宽远远小于下行带宽，即非对称 3. 数据链路层3.1 数据链路层信道类型 点对点信道，这种信道使用一对一的点对点通信方式 广播信道，这种信道使用一对多的广播通信方式 3.2 点对点信道 数据链路层的数据单元被称为帧。 数据链路层的三个基本问题： 封装成帧，每一种链路层协议都规定了所能传送的帧的数据部分长度的长限–最大传送单元MTU 透明传输 差错检测，数据链路层采用了循环冗余检验CRC，检验的是比特差错，并不保证可靠传输。 3.3 点对点协议PPP3.4 广播信道 局域网的数据链路层局域网：网络为一个单位所拥有，且地理范围和站点数目均有限 局域网按拓扑结构进行分类： 星形网，集线器(HUB) 环形网 总线网 以太网以太网的MTC为1500字节，采用载波监听多点接入/碰撞检测的方法来协调各主机的发送信息，因为总线上只要有一台计算机在发送数据，总线的传输资源就被占用，因此在同一时刻只允许一台计算机发送数据。以太交换换机不使用共享总线，因此不需要进行碰撞检测。 4. 网络层4.1 网络层提供的服务 面向连接的可靠传输 面向无连接的不可靠传输，尽最大努力交付 网络层提供数据报服务，发送的数据称为数据报、包或者分组。 4.2 网络层的主要协议 ARP地址解析协议，把IP地址转为物理地址Mac地址 ICMP网际控制报文协议，当网络层发生错误时，会通过ICMP协议进行通知 IGMP网络组管理协议，用于广播通信 IP封装上层传递下来的数据，屏蔽下层差异 4.3 IP分类4.3.1 IP的编址方法 分类IP 类别 标识 网络号字节 主机号字节 网络号范围 A 0 1 3 1.0.0.0 ~ 126.255.255.255 B 10 2 2 128.0.0.0 ~ 191.255.255.255 C 110 3 1 192.0.0.0 ~ 223.255.255.255 D 1110 多播地址 E 1111 保留 以下三个范围类的地址作为私有地址保留： A类保留地址 10.0.0.0 - 10.255.255.255 B类保留地址 172.16.0.0 - 172.31.255.255 C类保留地址 192.168.0.0 - 192.168.255.255 划分子网此时一个完整的IP地址由网络号、子网号和主机号组成，通过子网掩码能获取子网号。子网增加了灵活性，但是减少了可以接在网络上的主机总数。 构成超网（CIDR）构成超网是一种无分类的编址方法,它消除了IP分类及子网的概念，此时IP地址由网络前缀加上主机号组成。匹配时采用最长前缀匹配。 4.4 IP协议 IP数据报首部格式：20字节固定长度加上可选部分，最长是60字节 IP首部检验和只包含首部字段，并不包含数据部份 路由器路由表中的主要信息： 目的网络地址 下一跳地址 子网掩码 路由器的两个作用： 路由选择 分组转发 注：下一跳地址并不放在IP数据报中，而是在数据链路层通过ARP转成硬件地址后，放在MAC帧中 4.5 ICMP ICMP在两种情况下会发送报文，分别是IP数据报出现差错和出现异常时，会发两种报文，一类是差错报告报文，另一种是询问报文。 ICMP是网络层协议，可以由应用层直接使用，比如PING命令就直接使用了网络层，并没有通过运输层。 5. 运输层5.1 运输层通信与网络层的区别 网络层通信是主机间通信，运输层通信是进程间通信 差错检验，IP协议只检测首部，而TCP/UDP会检验首部加数据部分 5.2 运输层主要协议 TCP传输控制协议，面向连接，可靠交付，全双工通信，面向字节流。每一条TCP连接被通信两端的两个端点（即两个套接字，IP地址：端口号）唯一确定。FTP,HTTP,TELNET都使用了TCP协议 UDP用户数据报协议，它是一种无连接，尽最大努力交付且没有拥塞控制的协议 端口： 服务端使用的端口：熟知端口（0 ~ 1023），登记端口（1024 ~ 49151） 客户端端口：49152 ~ 65535 5.3 TCP可靠传输5.3.1 停止等待协议 停止等待协议在通信出现差错时会超时重传，并重置超时定时器，但是它的信道利用率很低，而流水线传输能提高信道利用率。 流水线传输会用到滑动窗口协议 发送方会维持一个发送窗口，收到一个确认后，发送窗口会向前滑动一个分组的位置，接收方可以进行累积确认 5.3.2 TCP首部格式 源端口和目的端口占16位 序号：报文段的序号 确认号：期望收到对方下一个报文段的第一个数据字节的序号 TCP有一个最大报文段长度MSS，它只是数据字段的最大长度，默认是536字节 5.3.3 可靠传输的实现 发送方维持一个发送窗口，接收方维持一个接收窗口，发送窗口的大小由接收方指定 超时重传时间的选择采一自适应算法：报文段有一个往返时间RTT，给往返时间进行加权平均的值称为RTTs，超时重传时间需要略大于RTTs 5.4 TCP流量控制采用滑动窗口进行流量控制 5.5 TCP拥塞控制 四种拥塞控制算法，发送方会维持一个拥塞窗口cwnd，还会设置一个慢开始门限ssthresh 慢开始，当cwnd &lt; ssthresh时采用慢开始 拥塞避免，当cwnd &gt; ssthresh时采用拥塞避免 快重传，当发送方收到3个重复确认时，可以认为发生了丢失，立刻重传丢失和报文段 快恢复，ssthresh设为cwnd的一半，同时设置cwnd=ssthresh。5.6 TCP连接5.6.1 三次握手 客户端发送SYN=1，seq=x报文，此时处于SYN-SENT状态 服务端收到后置ACK=1,SYN=1,ack=x+1,seq=y,此时处于SYN-REVD 客户端收到后置ACK=1,ack=y+1,seq=x+1,此时处于ESTABLISHED 5.6.2 四次挥手 客户端发送FIN=1,seq=x,此时处于FIN-WAIT-1 服务端收到后置ACK=1,ack=x+1,seq=y,此时处于CLOSE-WAIT，客户端收到后处于FIN-WAIT-2,客户端已没有数据发送，TCP连接处于半关闭状态 服务端发送FIN=1,ACK=1,seq=w,ack=x+1,此时处于LAST-ACK 客户端收到后置ACK=1,ack=w+1,seq=x+1,进行TIME-WAIT状态，等待2MSL(最长报文段寿命)后进入CLOSED状态。 6. 应用层6.1 域名系统DNS域名服务器分类： 根域名服务器，拥有所有顶级域名服务器的地址 国家顶级域名 通用顶级域名 基础结构域名 顶级域名服务器 权限域名服务器 本地域名服务器 域名解析时先到本地域名服务器查询，若没有则到根域名服务器，若没查到根域名服务器会告诉到哪一个域名服务器去查询，以次类推。 6.2 文件传输协议FTP6.3 超文本传输协议HTTP","link":"/2019/10/06/计算机网络/"},{"title":"五月十二","text":"&emsp;&emsp;今天是什么日子？今天是公元2019年5月12日，是我9000多天人生中平凡的一天，和往常一样没什么大事发生。 平凡？&emsp;&emsp;对，没错，今天只是一个普通的周末，过着和以往一样的生活，宅在家，看书、看剧、写代码。这似乎是每个程序猿都会感觉舒适的生活方式，至少我喜欢这种生活。所以也没什么可记录的，因为这是平凡的一天。 不平凡？&emsp;&emsp;非要说今天不平凡，那也没错。对，今天是各种社交软件已经预热了好几天的母亲节，朋友圈充斥着各式各样的孝儿孝女，不善表达的他们，在社交软件上尽情展示自己对母亲的爱。&emsp;&emsp;周末，母亲节，5月12日？今天还有一个特别的意义，11年前的今天，大概再过不到2个小时，我的故乡遭遇了一场巨大的灾难，没错，就是那场举国悲痛的大地震。那天不到15岁的我都经历了什么？记得，一切都记得，惊慌失措的脸庞，恐惧的眼神……但是，国难并不是让我今天写下这些文字的原因。 到底想说什么？&emsp;&emsp;不是因为国难，当然就是母亲节了。但并不只是想说我和我的母亲，在这个日子里想到母亲很自然的就会想起父亲。&emsp;&emsp;粗略一算，由于种种原因，我已经有六年没和父母说过话了，六年没见过面，没通过电话。似乎我的大脑里已经开始忘记他们的声音，他们的容貌，可以说我很不孝了吧。&emsp;&emsp;在我的印象中，母亲对我的要求一直很严格，在学业上必须名列前茅；但母亲又很包容，在生活上我的一些要求都会尽量满足我。母亲对我也很信任，找她要钱，也不会过问干什么，还会多给一点，她始终无条件的相信我，当然我面对这种信任，自然也不会辜负。“严父慈母”，似乎是给父母加的一个标签，但是我的父亲却不是一个严厉的父亲，他在学业上几乎不管我，可以算是放养了，所以从记事起到现在，我都不怎么怕父亲，在小学时期甚至觉得他是一个可以和我嬉戏的人。&emsp;&emsp;再我高中之前，我一直天真的以为家里条件不错，父母也是给我这样的感觉。现在想起来，还是太年轻，不知生活的不易，其实那个时候家里的经济来源并不稳定，且并不多，在这种情况下，他们能满足我的几乎所有要求，现在真是很感激。当然，我也并不是那么一味的索取，也会有一些回报，当然并不是物质上的，我的成绩在班里一直很不错，父母自然也高兴，在中考那年可以说还有点风光无限的意思了。请原谅我可能有点自卖自考的意思了，中考那年，我以全区第一的成绩考进了我们市里唯一一所国家级重点中学最好的理科班。那年成绩出来后，父母走在我们那小镇上都会被别人以羡慕的目光注视着。这大概就是我能想到的，我带给他们最大的回报了吧。&emsp;&emsp;大学毕业后，我想着可以回报父母了，可以在他们生日的时候不仅仅打个电话了，还可以送他们礼物了，这可是我靠自己的双手换来的礼物，父母肯定会喜欢的。然而，毕业已经三年了，我不但没送礼物，连电话都没打过。含辛茹苦二十年，却只得到了这样的回报？我算什么？我不知道。是什么让我和父母产生了如此大的距离，我清楚的知道原因，但我也无力改变，因为是生与死。&emsp;&emsp;我一直在想，如果他们还在我的身边，他们会知道，他们得到的不仅仅是陪伴，还会感受到二十多年的无私付出有了更多的意义，会因我而开心。可惜没如果，这一切都不会改变，因为现在我们之间隔着的是生与死的距离。","link":"/2019/05/12/五月十二/"}],"tags":[{"name":"读书笔记","slug":"读书笔记","link":"/tags/读书笔记/"},{"name":"互联网","slug":"互联网","link":"/tags/互联网/"},{"name":"硅谷","slug":"硅谷","link":"/tags/硅谷/"},{"name":"东野圭吾","slug":"东野圭吾","link":"/tags/东野圭吾/"},{"name":"悬疑推理","slug":"悬疑推理","link":"/tags/悬疑推理/"},{"name":"网络","slug":"网络","link":"/tags/网络/"},{"name":"随笔","slug":"随笔","link":"/tags/随笔/"}],"categories":[{"name":"LifeStyle","slug":"LifeStyle","link":"/categories/LifeStyle/"},{"name":"Technology","slug":"Technology","link":"/categories/Technology/"}]}